admin/controllers/CompanyController.php

	public function actionIndex()
	{
		$query = Company::find();
		$count = $query->count();
		$pagination = new Pagination([
			'totalCount' => $count,
			'defaultPageSize' => 5
		]);

		$data['company'] = $query->offset($pagination->offset)->limit($pagination->limit)->asArray()->all();
---
SELECT COUNT(*) FROM `rec_company`
SELECT * FROM `rec_company` LIMIT 5

	public function actionPeriod()
	{
		$query = Period::find();
		$count = $query->count();
		$pagination = new Pagination([
			'totalCount' => $count,
			'defaultPageSize' => 5
		]);

		$data['period'] = $query->offset($pagination->offset)->limit($pagination->limit)->asArray()->all();
---
SELECT COUNT(*) FROM `rec_period`
SELECT * FROM `rec_period` LIMIT 5