admin/controllers/LoginController.php

SELECT * FROM `user` WHERE uid=5
---
	public function actionSel_user()
	{
		$session = Yii::$app->session;

		$admin = $session->get('admin');
		$res = User::find()->where('uid='.$admin['uid']);
		$data['user'] = $res->asArray()->one();

SELECT * FROM `user` WHERE invite_id=5&& add_time between "2016-11-10" and "2016-11-15"
---
	public function actionInquire()
	{
		//请求组件
		$request = \Yii::$app->request;

		$uid = $request->get('uid');
		$starttime = $request->get('starttime');
		$stoptime = $request->get('stoptime');

		$user = User::find()->where('invite_id='.$uid.'&& add_time between "'.$starttime.'" and "'.$stoptime.'"')->asArray()->all();